## DNS
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.api-notification-alpha-canada-ca-ACM-cname will be created
  + resource "aws_route53_record" "api-notification-alpha-canada-ca-ACM-cname" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_5d022a2aee7df473fcb75e0e12b47220.api.notification.alpha.canada.ca"
      + records         = [
          + "_f52039e56b4219e56f5e258613b5c77d.mqzgcdqkwq.acm-validations.aws.",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z33C47YI9EN8XL"
    }

  # aws_route53_record.api-notification-canada-ca-ACM-cname will be created
  + resource "aws_route53_record" "api-notification-canada-ca-ACM-cname" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_902cdb1a2cb8214fc698261ee3085b64.api.notification.canada.ca"
      + records         = [
          + "_ac309158c158035bfb929da1617e2b16.mqzgcdqkwq.acm-validations.aws.",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z1XG153PQF3VV5"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.alpha-canada-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.cds-snc-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.notification-canada-ca-public"]

20 tests, 17 passed, 3 warnings, 0 failures, 0 exceptions

```

</details>
